Model Summary
==================================================================================================

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 256, 256, 3)  0                                            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256, 256, 6)  0           input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 62, 62, 96)   69792       concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 62, 62, 96)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 30, 30, 96)   0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 30, 30, 256)  614656      average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 30, 30, 256)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 14, 14, 256)  0           activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 384)  885120      average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 14, 14, 384)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 14, 14, 384)  1327488     activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 14, 14, 384)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 14, 14, 256)  884992      activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 14, 14, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 6, 6, 256)    0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 6, 6, 256)    65792       average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 6, 6, 256)    0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 12, 12, 256)  0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 10, 10, 384)  885120      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 10, 10, 384)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 20, 20, 384)  0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 18, 18, 384)  1327488     up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 18, 18, 384)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 36, 36, 384)  0           activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 256)  2457856     up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 256)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 64, 64, 256)  0           activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 96)   614496      up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 64, 64, 96)   0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 128, 128, 96) 0           activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 128, 3)  7203        up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 128, 3)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 256, 256, 3)  0           activation_11[0][0]              
==================================================================================================

Total params: 9,140,003
Trainable params: 9,140,003
Non-trainable params: 0